trade_exp/src/InformationRegisters/ГрафикПоставокНаСклад/ГрафикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b705356a-3674-4009-9b19-325f4f8d31b5">
  <name>ГрафикПоставокНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="76b53ffb-1cb8-4f02-8672-d6fb75f950f8">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="7d8d9c96-2e82-42e6-9eaa-77e664a95aa0">
    <name>ДатаВремяРазгрузкиПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="554d2043-23c2-4d8a-8d1f-7673b049aace">
    <name>ПродолжительностьРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c907b0-a3c4-480d-b8cf-9e1a032a4aea">
    <name>ДатаВремяПриездаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b09375dc-860d-4367-bc6f-b6ac98e85b4a">
    <name>КоличествоИспользуется</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="2e92b9a3-164e-497a-a5c9-88c89460f830">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbd2790-7240-447e-8d1d-bbebc3396ef2">
    <name>СогласованоСоСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a7ccbc1-15a7-4f8d-a54f-41f83a07c417">
    <name>ТекстПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="4e117ade-5a52-4e6e-9ee4-f1a871bf22bd">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c96af1ba-579e-4dd9-8e21-ed2ba80d3cad">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостояниеОтгрузкиДокумента/СостояниеОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6e2a290-cbc8-4936-bbb2-90e8d1c0db51">
  <name>СостояниеОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="dffce7aa-5f60-4a23-8318-5410c67632ff">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1cc5b099-9bfb-4b1e-8a24-a86abbfec9a4">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4a9099ca-f5d8-4382-a001-2e51e75cdaa1">
    <name>ОценкаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="46ae374e-4820-4eae-9365-1ccc6b8c5430">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d745fd3-8b9f-420d-a661-da3ab7a348d2">
    <name>НомерЗаезда</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="c260e72d-b1f0-4145-ad5d-b7ddd7768010">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f50361ea-5ef2-4f47-b334-48a3a4671d38">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияОтгрузкиДокумента/СостоянияОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4aae44bd-66b0-4e44-a260-c24e6ec64d86">
  <name>СостоянияОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8e84c8e8-e768-4147-96fc-6d48a0109758">
    <name>ВОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="819c0e3a-7dc1-4053-bee0-2c94c94a81a1">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7cd0e61f-5363-4ced-bdbb-463d617df349">
    <name>Выехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78b7332e-7f20-463b-b919-4c9896d784b6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes extendedConfigurationObject="fe815fb5-1875-4130-acf3-35d54b6300d2">
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57ed9ee0-517f-4fb9-bc74-2d8fcd4d0a4b">
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4dc73fe7-64ac-43ce-ab0c-df92d01c6311">
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e0d07478-37ac-42f6-a26a-04f4fa4c4743">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebb5bfee-de18-4d14-a24f-e32cbdd90cf9">
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23aae39e-0410-48bc-917a-96177b6e468b">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7f52563-0c7c-4de6-ac07-6ef01ff7688d">
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35306e02-2ad1-4232-a398-068a769610be">
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be5c2342-1fad-40cf-b4f7-a1017bc7e542">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af87b08a-d7f9-4ad8-9eec-e3f927c89172">
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df4a78ba-9180-411a-943d-2eaf96f21d69">
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba8289fe-be8a-45a4-819c-2c2f84c4de2f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5aa38e35-acdf-4eae-a145-4407937beec7">
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f74a4575-a405-4411-b8a1-f7dda30e2967">
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="922b22b5-b814-4d15-b669-ded6f1e11a61">
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7304712c-4a4e-40e0-be6c-a895e78d8825">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f2cd6a4-d354-43cb-b6e5-9f43829d8bc3">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b61ba6a-896e-4ef0-98cc-bb012362f16c">
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1306a2c8-039b-4b1b-a808-f8fc27b47f72">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0192ca1-e274-4de7-a7bd-ffca9512f173">
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c40dec99-d7f0-45f7-94f9-5288383ea7f7">
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="993b535f-c665-4cc4-b466-d11667bec4fa">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4378e490-1e5e-4dd6-a3db-03d426ec7986">
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/CommonModules/Альтерра_СеткаПоставок/Module.bsl
#Область ИзменениеДанных

// Вносит изменения в данные по поставке
//
// Параметры:
//  МассивЗаказов  - Массив (СправочникСсылка.ЗаказыПоставщику) - заказы, состояние которых должно измениться в сетке. Можно отправлять один заказ не в массиве.
//                
//  УсловиеЗаписи - Строка - предопределенные значения. "Новое", "Редактирование", "Удаление", "РейсИзменениеПлана". Для удаления записи получаем предопределенную структуру, например.
//
//  ИзменяемыеПараметры  - Соответствие, стуктура - Соответствие: ключ - "ЗаказПоставщику", значение - структура параметров. Если параметры одинаковые для всех предполагаемых строк, можно передать структурой. 
//                                                                                    Отдельный параметры структуры - "Оборудование" должен иметь тип "Соответствие" с ключом - ТехРесурс и значение - его количество
//  РедактированиеИзЗаказа - Булево - могла ли измениться ТЧ с оборудованием или нет.
//
Процедура ИзменитьДанныеСеткиПоставок(Знач МассивЗаказов, УсловиеЗаписи, ИзменяемыеПараметры=Неопределено, РедактированиеИзЗаказа=Ложь) Экспорт
	
	Если ТипЗнч(МассивЗаказов) <> Тип("Массив") Тогда
		Заказ = МассивЗаказов;
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(Заказ);
	КонецЕсли;
	
	//предварительная обработка полученных параметров
	Если ИзменяемыеПараметры = Неопределено Тогда
		Если ВРег(УсловиеЗаписи) = ВРег("Новое") Тогда
		КонецЕсли;
	КонецЕсли;
	
	//получение/редактирование данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяПриездаФакт КАК ДатаВремяПриездаФакт,
	|	ГрафикПоставокНаСкладСрезПоследних.КоличествоИспользуется КАК КоличествоИспользуется,
	|	ГрафикПоставокНаСкладСрезПоследних.СогласованоСоСкладом КАК СогласованоСоСкладом,
	|	ГрафикПоставокНаСкладСрезПоследних.ТекстПоставки КАК ТекстПоставки
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних(, ЗаказПоставщику В (&МассивЗаказов)) КАК ГрафикПоставокНаСкладСрезПоследних
	|ИТОГИ
	|	МАКСИМУМ(Поток),
	|	МАКСИМУМ(ДатаВремяРазгрузкиПлан),
	|	МАКСИМУМ(ПродолжительностьРазгрузки),
	|	МАКСИМУМ(ДатаВремяПриездаФакт),
	|	СУММА(КоличествоИспользуется),
	|	МАКСИМУМ(СогласованоСоСкладом),
	|	МАКСИМУМ(ТекстПоставки)
	|ПО
	|	ЗаказПоставщику,
	|	Оборудование";
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаказы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказПоставщику");
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ПустойПоток = Справочники.РабочиеУчастки.ПустаяСсылка();
	Пока ВыборкаЗаказы.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаЗаказы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Оборудование");
		Если ИзменяемыеПараметры<>Неопределено Тогда
			Если ТипЗнч(ИзменяемыеПараметры) = Тип("Соответствие") Тогда
				ПараметрыЗаказа = ИзменяемыеПараметры[ВыборкаЗаказы.ЗаказПоставщику];
			Иначе
				ПараметрыЗаказа = ИзменяемыеПараметры;
			КонецЕсли;
		КонецЕсли;
		
		Если РедактированиеИзЗаказа Тогда
			ЕстьОборудование =  ПараметрыЗаказа.Свойство("Оборудование");
			Если ЕстьОборудование Тогда
				ОборудованиеЗаказа = ПараметрыЗаказа["Оборудование"];
				Для каждого СтрОборудования из ОборудованиеЗаказа Цикл
					НаборЗаписейГрафикаПоставок = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьНаборЗаписей();
					НаборЗаписейГрафикаПоставок.Отбор.ЗаказПоставщику.Установить(ВыборкаЗаказы.ЗаказПоставщику);
					НаборЗаписейГрафикаПоставок.Отбор.Оборудование.Установить(СтрОборудования.Ключ);
					НоваяЗапись = НаборЗаписейГрафикаПоставок.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаЗаказы);
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.АвторИзменений = ТекущийПользователь;
					НоваяЗапись.Оборудование = СтрОборудования.Ключ;
					НоваяЗапись.КоличествоИспользуется = СтрОборудования.Значение;
					Если НаборЗаписейГрафикаПоставок.Количество()>0 Тогда
						УстановитьПривилегированныйРежим(Истина);
						НаборЗаписейГрафикаПоставок.Записать(Ложь);
						УстановитьПривилегированныйРежим(Ложь);
					КонецЕсли;
				КонецЦикла;
			Иначе
				НоваяЗапись = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыЗаказа);
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.ЗаказПоставщику = Заказ;
				НоваяЗапись.АвторИзменений = ТекущийПользователь;
				УстановитьПривилегированныйРежим(Истина);
				НоваяЗапись.Записать(Ложь);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		Иначе
			//оборудование
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаборЗаписейГрафикаПоставок = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьНаборЗаписей();
				НаборЗаписейГрафикаПоставок.Отбор.ЗаказПоставщику.Установить(ВыборкаЗаказы.ЗаказПоставщику);
				НаборЗаписейГрафикаПоставок.Отбор.Оборудование.Установить(ВыборкаДетальныеЗаписи.Оборудование);
				Если БудемЗаписыватьДанные(УсловиеЗаписи, ИзменяемыеПараметры, ВыборкаДетальныеЗаписи) Тогда
					НоваяЗапись = НаборЗаписейГрафикаПоставок.Добавить();
					НоваяЗапись.Период = ТекущаяДата();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					НоваяЗапись.АвторИзменений = ТекущийПользователь;
					
					Если ВРег(УсловиеЗаписи) = ВРег("Удаление") Тогда
						НоваяЗапись.ДатаВремяРазгрузкиПлан = НачалоДня(НоваяЗапись.ДатаВремяРазгрузкиПлан);
					Иначе
						Для каждого Параметр Из ПараметрыЗаказа Цикл
							Если Параметр.Ключ = "Оборудование" Тогда
								Если Параметр.Значение[ВыборкаДетальныеЗаписи.Оборудование]<>Неопределено Тогда
									Значение = ВыборкаДетальныеЗаписи.Оборудование;
									НоваяЗапись.КоличествоИспользуется = Параметр.Значение[ВыборкаДетальныеЗаписи.Оборудование];
								КонецЕсли;
							Иначе
								Значение = Параметр.Значение;
							КонецЕсли;
							НоваяЗапись[Параметр.Ключ] = Значение;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				Если НаборЗаписейГрафикаПоставок.Количество()>0 Тогда
					УстановитьПривилегированныйРежим(Истина);
					НаборЗаписейГрафикаПоставок.Записать(Ложь);
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ВРег(УсловиеЗаписи) <> ВРег("Удаление") Тогда
		//создание нового интервала поставки
		Если ВыборкаЗаказы.Количество()=0 Тогда
			Заказ = МассивЗаказов[0];
			Если ТипЗнч(ИзменяемыеПараметры) = Тип("Соответствие") Тогда
				ПараметрыДокумента = ИзменяемыеПараметры[Заказ];
			Иначе
				ПараметрыДокумента = ИзменяемыеПараметры;
			КонецЕсли;
			ЕстьОборудование =  ПараметрыДокумента.Свойство("Оборудование");
			Если ЕстьОборудование Тогда
				ОборудованиеЗаказа = ПараметрыДокумента["Оборудование"];
			Иначе
				ОборудованиеЗаказа = Новый Массив;
				ОборудованиеЗаказа.Добавить(Справочники.ТехническиеРесурсыСклада.ПустаяСсылка());
			КонецЕсли;
			Для каждого СтрОборудования из ОборудованиеЗаказа Цикл
				НоваяЗапись = РегистрыСведений.ГрафикПоставокНаСклад.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ПараметрыДокумента);
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.ЗаказПоставщику = Заказ;
				НоваяЗапись.АвторИзменений = ТекущийПользователь;
				Если ЕстьОборудование Тогда
					НоваяЗапись.Оборудование = СтрОборудования.Ключ;
					НоваяЗапись.КоличествоИспользуется = СтрОборудования.Значение;
				КонецЕсли;
				УстановитьПривилегированныйРежим(Истина);
				НоваяЗапись.Записать(Ложь);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЧтениеДанных

// Получить состояние поставки
//
// Параметры:
//  МассивЗаказов - массив - список заказов, для которых необходимо получить
//                 текущее состояние поставки
//  ПолучитьПоследнее - булево - получить только последнее актуальное состояние или полную таблицу состояний поставки 
//
// Возвращаемое значение:
//  таблица значений   - если требуется получить последнее, то результат с колонками "Заказ", "СостояниеПоставки", "ВремяИзмененияСостоянияПоставки". В случаях с состоянием "Запланирована" подтягивается не дата изменения, 
//                 а дата, на которую была запланирована поставка. Если требуются все состояния - передается таблица "Заказ", "ТекущееСостояние", "ВремяПрибытие", "ВремяВъезд", "ВремяВыезд"
//
Функция ПолучитьТекущееСостояниеПоставки(МассивЗаказов, ПолучитьПоследнее = Истина) Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Заказ
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка В(&МассивЗаказов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Документ КАК Документ,
		|	МИНИМУМ(Итог.ВремяВъезд) КАК ВремяВъезд,
		|	МАКСИМУМ(Итог.ВремяВыезд) КАК ВремяВыезд
		|ПОМЕСТИТЬ втОтметкиКПП
		|ИЗ
		|	(ВЫБРАТЬ
		|		СостояниеОтгрузкиДокумента.Документ КАК Документ,
		|		ВЫБОР
		|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)
		|				ТОГДА МИНИМУМ(СостояниеОтгрузкиДокумента.Период)
		|		КОНЕЦ КАК ВремяВъезд,
		|		ВЫБОР
		|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Выехал)
		|				ТОГДА МАКСИМУМ(СостояниеОтгрузкиДокумента.Период)
		|		КОНЕЦ КАК ВремяВыезд
		|	ИЗ
		|		РегистрСведений.СостояниеОтгрузкиДокумента КАК СостояниеОтгрузкиДокумента
		|	ГДЕ
		|		СостояниеОтгрузкиДокумента.Документ В(&МассивЗаказов)
		|		И СостояниеОтгрузкиДокумента.Состояние В(&СтатусыДоставки)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СостояниеОтгрузкиДокумента.Документ,
		|		СостояниеОтгрузкиДокумента.Состояние) КАК Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	Итог.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|	""Прибыл"" КАК Состояние,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяПриездаФакт КАК ДатаСостояния,
		|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан
		|ПОМЕСТИТЬ втЗаездыФакт
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
		|		ПО втЗаказы.Заказ = ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаездыФакт.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтметкиКПП.ВремяВыезд, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Выехал""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(втОтметкиКПП.ВремяВъезд, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ""Заехал""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(втЗаездыФакт.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА ""Прибыл""
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЕСТЬNULL(втЗаездыФакт.ДатаВремяРазгрузкиПлан, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
		|									ТОГДА ""Запланирована""
		|								ИНАЧЕ ""Не запланирована""
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ТекущееСостояние,
		|	ЕСТЬNULL(втЗаездыФакт.ДатаСостояния, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяПрибытие,
		|	ЕСТЬNULL(втОтметкиКПП.ВремяВъезд, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяВъезд,
		|	ЕСТЬNULL(втОтметкиКПП.ВремяВыезд, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяВыезд
		|ПОМЕСТИТЬ втИтог
		|ИЗ
		|	втЗаездыФакт КАК втЗаездыФакт
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОтметкиКПП КАК втОтметкиКПП
		|		ПО втЗаездыФакт.Заказ = втОтметкиКПП.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Заказ КАК Заказ,
		|	втИтог.ТекущееСостояние КАК ТекущееСостояние,
		|	втИтог.ВремяПрибытие КАК ВремяПрибытие,
		|	втИтог.ВремяВъезд КАК ВремяВъезд,
		|	втИтог.ВремяВыезд КАК ВремяВыезд
		|ИЗ
		|	втИтог КАК втИтог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИтог.Заказ КАК Заказ,
		|	втИтог.ТекущееСостояние КАК СостояниеПоставки,
		|	ВЫБОР
		|		КОГДА втИтог.ВремяВыезд <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА втИтог.ВремяВыезд
		|		ИНАЧЕ ВЫБОР
		|				КОГДА втИтог.ВремяВъезд <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА втИтог.ВремяВъезд
		|				ИНАЧЕ ВЫБОР
		|						КОГДА втИтог.ВремяПрибытие <> ДАТАВРЕМЯ(1, 1, 1)
		|							ТОГДА втИтог.ВремяПрибытие
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяИзмененияСостоянияПоставки
		|ИЗ
		|	втИтог КАК втИтог";
		СтатусыДоставки = Новый Массив;
		СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
		СтатусыДоставки.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
		Запрос.УстановитьПараметр("СтатусыДоставки", СтатусыДоставки);
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		УстановитьПривилегированныйРежим(Ложь);
		Если ПолучитьПоследнее Тогда
			ТЗ = РезультатЗапроса[5].Выгрузить();
			
		Иначе
			ТЗ = РезультатЗапроса[4].Выгрузить();
		КонецЕсли;
		Возврат ТЗ;
	
КонецФункции

#КонецОбласти

#Область Вспомогательные
//Проверка на транзитный склад (у них нет секций)
Функция ЕстьСекцииУСклада(ПроверяемыйСклад) Экспорт 
	ЗапросУчастки = Новый Запрос;
	ЗапросУчастки.Текст = "ВЫБРАТЬ
	                      |	РабочиеУчастки.Ссылка КАК РабочийУчасток
	                      |ИЗ
	                      |	Справочник.РабочиеУчастки КАК РабочиеУчастки
	                      |ГДЕ
	                      |	РабочиеУчастки.Владелец = &Склад
	                      |	И РабочиеУчастки.ПометкаУдаления = ЛОЖЬ";
	ЗапросУчастки.УстановитьПараметр("Склад", ПроверяемыйСклад);
	Результат = ЗапросУчастки.Выполнить();
	Выборка = Результат.Выбрать();
	Если  Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗапросПоТЗВесОбъем(ТабТовары, ДокументСсылка=Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тз.Номенклатура КАК Номенклатура,
	|	тз.Количество КАК КоличествоУпаковок,
	|	тз.Упаковка,
	|	&Ссылка КАК ЗаказПоставщику,
	|   тз.Отменено
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&ТЗ КАК тз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА втТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА спрНоменклатура.ЕдиницаИзмерения
	|		ИНАЧЕ втТовары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	спрНоменклатура.ВесЕдиницаИзмерения КАК НоменклатураВесЕдиницаИзмерения,
	|	спрНоменклатура.ОбъемЕдиницаИзмерения КАК НоменклатураОбъемЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.ВесЗнаменатель <> 0
	|			ТОГДА спрНоменклатура.ВесЧислитель / спрНоменклатура.ВесЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВесКоэффициентНоменклатура,
	|	ВЫБОР
	|		КОГДА спрНоменклатура.ОбъемЗнаменатель <> 0
	|			ТОГДА спрНоменклатура.ОбъемЧислитель /спрНоменклатура.ОбъемЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемКоэффициентНоменклатура
	|ПОМЕСТИТЬ втНоменклатураДокумента
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО втТовары.Номенклатура = спрНоменклатура.Ссылка
	|ГДЕ втТовары.Отменено=Ложь";
	Запрос.УстановитьПараметр("ТЗ", ТабТовары);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	СтруктураЗапрос = Новый Структура;
	СтруктураЗапрос.Вставить("Запрос", Запрос);
	АдресЗапросаКоэффициентыТоваров = ПоместитьВоВременноеХранилище(СтруктураЗапрос, Новый УникальныйИдентификатор());

	Возврат АдресЗапросаКоэффициентыТоваров;
КонецФункции

Функция БудемЗаписыватьДанные(УсловиеЗаписи, ПараметрыУсловияЗаписи, СтрокаВыборки)

	Если  УсловиеЗаписи <> "РейсИзменениеПлана" Тогда
		Возврат Истина;
	Иначе
		Если ПараметрыУсловияЗаписи.ДатаВремяРазгрузкиПлан <> НачалоДня(СтрокаВыборки.ДатаВремяРазгрузкиПлан) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;	

	Возврат Ложь;
КонецФункции

#КонецОбласти
